Autodesk.Navisworks.Api.SavedItem
Base class for all saved items.

Autodesk.Navisworks.Api.SavedItem.CanTransform
Indicates whether the implementation of Transform() will do anything
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SavedItem.Comments
Comments about the item
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SavedItem.CreateCopy
Create a new copy of this item
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SavedItem.CreateNewInstance
Create a new item of the same type as this item
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SavedItem.CreateUniqueCopy
Create an unique copy of item
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SavedItem.DisplayName
Name for item as displayed in the GUI
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.SavedItem.Guid
Globally Unique Id for item
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.SavedItem.IsGroup
True if this item is a GroupItem
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SavedItem.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.SavedItem.MakeDisplayNameUnique(Autodesk.Navisworks.Api.GroupItem)
Makes a name unique within the immediate children on the group
group: group to make unique name
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'group' has been Disposed

Autodesk.Navisworks.Api.SavedItem.MakeDisplayNameUnique(Autodesk.Navisworks.Api.GroupItem,System.String)
Makes a name unique within the immediate children on the group
group: group to make unique name
salt: salt string to use in making a name unique
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'group' has been Disposed

Autodesk.Navisworks.Api.SavedItem.Parent
Parent of this item. Null if item has no parent
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SavedItem.Transform(Autodesk.Navisworks.Api.Transform3D)
Apply the given transform to the item
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'transform' is null
Throws System.ArgumentException:
Argument 'transform' has been Disposed